"""
6. Реализовать функцию int_func(), принимающую слово из маленьких латинских букв и возвращающую его же, но с прописной
первой буквой. Например, print(int_func(‘text’)) -> Text.
Продолжить работу над заданием. В программу должна попадать строка из слов, разделенных пробелом.
Каждое слово состоит из латинских букв в нижнем регистре. Сделать вывод исходной строки, но каждое слово
должно начинаться с заглавной буквы. Необходимо использовать написанную ранее функцию int_func().
"""

def int_func(word):
    s = word[0]
    b = chr(ord(s) - ord('a') + ord('A'))
    return b + word[1:]

i = input('Введите текст: ').split()
res = []
for word in i:
    res.append(int_func(word))
print(' '.join(res))


#def int_func(word):
#   return word.title()
#word = input('Введите текст: ')
#print(int_func(word))
